CREATE TABLE Readers--создала ТАБЛИЦУ "ЧИТАТЕЛИ" (СУЩ. READErs) В БАЗЕ ДАННЫХ "БИБЛИОТЕКА" (library)
( 
    reader_id SERIAL PRIMARY KEY, --ID ГЕНЕРИРУЕТСЯ АВТОМАТИЧЕСКИ, SERIAL делает "n+1" 
    full_name VARCHAR(255) NOT NULL, --ФИО ЧИТАТЕЛЯ, ВАРЧАР ЗАДАЛА СОГЛАСНО ОГРАНИЧЕНИЯМ ЗАГСА
    phone VARCHAR(16) UNIQUE NOT NULL--НОМЕР ТЕЛЕФОНА, ВАРЧАР ЗАДАЛА СОГЛАСНО ДЛИНЕ НАЦИОНАЛЬНОГО ФОРМАТА РФ с учетом символов, UNIQUE строго следит, что бы повторов не было
); 
/* 2026-10-13 19:32:44 [262 ms] */ 
CREATE TABLE books
( 
    isbn VARCHAR(13) PRIMARY KEY, --ID, Современный международный стандартный книжный номер (ISBN) состоит из 13 цифр
    title VARCHAR(255) NOT NULL, --НАЗВАНИЕ КНИГИ, ВАРЧАР ЗАДАЛА СОГЛАСНО ОГРАНИЧЕНИЯМ ЗАГСА
    year_publish INTEGER CHECK(year_publish >= 800 AND year_publish <= 2090) --ГОД ПУБЛИКАЦИИ, ЦЕЛОЕ ЧИСЛО, ограничения заданы с запасом от известной даты издания первой книги и чуть-чуть на будущее
);
/* 2026-10-13 19:45:36 [24 ms] */ 
CREATE TABLE authors
( 
    author_id SERIAL PRIMARY KEY, --ID автора
    full_name VARCHAR(255) NOT NULL --ФИО автора, not null что бы поле было обязательно заполненно

);
/* 2026-10-13 21:09:57 [82 ms] */ 
CREATE TABLE Authorship--создала связующую таблицу "авторство" в базе данных "библиотека", дополнительная таблица для отношения многие ко многим между таблицами "книги" и "авторы"

( 
    isbn varchar(13) ,--ID книги, внешний ключ на таблицу "книги"
    author_id INT,--ID автора, внешний ключ на таблицу "авторы", интеджер указала так как в таблице "авторы" первичный ключ имеет тип SERIAL, который является INT
    PRIMARY KEY(isbn, author_id) , --составной первичный ключ
    FOREIGN KEY (isbn) REFERENCES books(isbn) ,--внешний ключ на таблицу "книги", преференсес указывают на конкретное поле
    FOREIGN KEY (author_id) REFERENCES authors(author_id)-- внешний ключ на таблицу "авторы"
);
/* 2026-10-13 22:37:47 [48 ms] */ 
CREATE TABLE loan --создала таблицу "выдача", дополнительная таблица для отношения многие ко многим между таблицами "книги" и "читатели"
( 
    loan_id SERIAL, --ID сздается автоматически, сериал делает "n+1" при добавлении новой записи
    reader_id INT NOT NULL, --ID читателя,нот нулл что бы поле было обязательно заполненно
    isbn VARCHAR(13) NOT NULL, --ID книги, нот нулл знаем, я устала писать поясненяи
    loan_date DATE NOT NULL, --дата выдачи книги, нот нулл..да...нот нул...мой любимый нот нулл...
    return_date DATE NOT NULL, --дата возврата книги, не может быть null, при выдаче сразу указывается дата возврата
    actual_return_date DATE,--дата фактического возврата книги, может быть null если книга не возвращена
    PRIMARY KEY(loan_id), --первичный ключ
    FOREIGN KEY (reader_id) REFERENCES Readers(reader_id) ,--внешний ключ на таблицу "читатели"
    FOREIGN KEY (isbn) REFERENCES books(isbn),--внешний ключ на таблицу "книги", преференсес указывают на конкретное поле
    CHECK (return_date >= loan_date), --возврат не может быть раньше выдачи
    CHECK (actual_return_date IS NULL OR actual_return_date >= loan_date) --по сути, реализация возможности продления срока "аренды" книги
);
--господи, лишь бы оно работало
--приступим к заполнению таблиц(НАКОНЕЦ, УРА!!!!)
INSERT INTO readers (full_name, phone) values 
('Иван Соколов','+7-900-222-33-44'),
('Мария Ким','+7-900-333-44-55'),
('Олег Васильев','+7-900-444-55-66');/* 2026-10-14 00:29:15 [13 ms] */ 
ALTER TABLE readers ALTER COLUMN phone TYPE VARCHAR(20);--исправляю косяки, учту что варчар всегда стоит брать с запасом,
/* 2026-10-14 00:29:23 [17 ms] */ 
INSERT INTO readers (full_name, phone) values
('Иван Соколов','+7-900-222-33-44'),
('Мария Ким','+7-900-333-44-55'),
('Олег Васильев','+7-900-444-55-66');
/* 2026-10-14 00:29:23 [17 ms] */ 
INSERT INTO readers (full_name, phone) values
('Анна Петрова','+7-900-111-22-33'),
('Иван Соколов','+7-900-222-33-44'),
('Мария Ким','+7-900-333-44-55'),
('Олег Васильев','+7-900-444-55-66');
SELECT * FROM readers;
--кароче, пока разбиралась, нкосячила знатно, щас закончу и норм поясню каждую строку
TRUNCATE TABLE readers RESTART IDENTITY CASCADE;--очистила всю таблицу, что бы заполнить заново, а то Анна потерялась из-за того что не учла символы в записи номера
INSERT INTO readers (full_name, phone) values--ну типа, инсерт инто ридерс, буквально говорим прогремме в какую конкретную таблицу хотим вносить данные, потом в скобках указываем уточняем поля, ну а валуес(если я правилно разобралась) что бы пк увидел сами значения, в сколбках ниже
('Анна Петрова','+7-900-111-22-33'), --тут важно что бы значения были в '', через запятую и строго в том порядке, который мы указали в строке инсерт
('Иван Соколов','+7-900-222-33-44'),
('Мария Ким','+7-900-333-44-55'),
('Олег Васильев','+7-900-444-55-66');--ура, починила!!
ALTER TABLE books ALTER COLUMN isbn TYPE VARCHAR(20);--тот же косяк, что и с phone в readers
INSERT INTO books (isbn, title, year_publish) values --меня уже ии троллит с пояснениями, так что я не буду пояснять каждую строку как до этого, с инсерт проще
('978-5-17-118366-0','Война и мир',1869),
('978-5-17-118367-7','Преступление и наказание',1866),
('978-5-17-118368-4','Мастер и Маргарита',1967),
('978-5-17-118369-1','Золотой теленок',1931),
('978-5-17-118370-7','Пикник на обочине',1972);--о, все, поехало, с 1 раза зафурычил
INSERT INTO authors (full_name) values
('Лев Толстой'),
('Федор Достоевский'),
('Михаил Булгаков'),
('Илья Ильф'),
('Евгений Петров'),
('Аркадий Стругацкий'),
('Борис Стругацкий');--с1 попытки х2!!
INSERT INTO authorship (isbn, author_id) values --ну с этим мы знакомы, тут анологично
('978-5-17-118366-0',1), --тут все просто, указзываем буквально что к чему и оно работает
('978-5-17-118367-7',2),
('978-5-17-118368-4',3),
('978-5-17-118369-1',4),-- лан, я слишком устала, если скину неотредаченным, то я готова к вопросам
('978-5-17-118369-1',5),-- ну то что у одной книги 2 автора мы пишем на разных строках, потому что порядковый номер это праймори кей
('978-5-17-118370-7',6), 
('978-5-17-118370-7',7);
ALTER TABLE books ALTER COLUMN isbn TYPE VARCHAR(20);
ALTER TABLE authorship ALTER COLUMN isbn TYPE VARCHAR(20);
ALTER TABLE loan ALTER COLUMN isbn TYPE VARCHAR(20); --ну да, косяки пропустила, каюсь
INSERT INTO loan (reader_id, isbn, loan_date, return_date, actual_return_date) VALUES 
(1, '978-5-17-118368-4', '2026-09-01', '2026-09-15', '2026-09-14'), -- тут книга возвращена
(1, '978-5-17-118367-7', '2026-10-01', '2026-10-15', NULL),         -- а тут на руках еще
(1, '978-5-17-118366-0', '2026-10-10', '2026-10-24', NULL),
(2, '978-5-17-118369-1', '2026-09-10', '2026-09-24', '2026-09-22'),
(3, '978-5-17-118370-7', '2026-09-15', '2026-09-29', '2026-10-02'), -- а тут продлили, но вернули
(4, '978-5-17-118368-4', '2026-10-05', '2026-10-19', NULL);
ALTER TABLE loan DROP CONSTRAINT loan_check1;

ALTER TABLE loan ADD CONSTRAINT loan_actual_return_date_check 
    CHECK (actual_return_date IS NULL OR actual_return_date >= loan_date);--о, мои любимые косяки
    SELECT isbn, title FROM books;--косяк исправлен, он в моей усталости, простите
    --bbbb!!! долгожданный финиш! по прямой!
    UPDATE readers --указываем к какой таблице обращаемся
SET phone = '+7-999-555-66-77' --указываем конкретную ячейку, и вносим новые данные
WHERE reader_id = 2;--указываем, что меняем не у всех, а по ID/* 2026-10-14 03:26:40 [50 ms] */ 
UPDATE readers --указываем к какой таблице обращаемся
SET phone = '+7-999-555-66-77' --указываем конкретную ячейку, и вносим новые данные
WHERE reader_id = 2;
/* 2026-10-14 03:26:40 [50 ms] */ 
UPDATE readers --указываем к какой таблице обращаемся
SET phone = '+7-999-555-66-77' --указываем конкретную ячейку, и вносим новые данные
WHERE reader_id = 2;
SELECT * FROM readers;--проверка лишней не бывает
UPDATE loan 
SET actual_return_date = '2026-10-14' 
WHERE loan_id = 27;--работает анологично как и прошлая, просто информация другая
SELECT * FROM loan;
INSERT INTO readers (full_name, phone) --+тестовый читатель
VALUES ('Тестовый Читатель', '+7-000-000-00-00');
DELETE FROM readers 
WHERE full_name = 'Тестовый Читатель'; --удалили его по именни 
INSERT INTO readers (full_name, phone) --+тестовый читатель
VALUES ('Тестовый Читатель', '+7-000-000-00-00');
DELETE FROM readers 
WHERE phone = '+7-000-000-00-00';--по телеофну
INSERT INTO readers (full_name, phone) --+тестовый читатель
VALUES ('Тестовый Читатель', '+7-000-000-00-00');
DELETE FROM readers 
WHERE full_name = 'Тестовый Читатель' AND phone = '+7-000-000-00-00';--удалили по обоим показателям сразу
--ура, я все поняла и осознала(без справочника навряд ли справлюсь)
